import jiagu

# 吻别是由张学友演唱的一首歌曲。
# 苏州大学（Soochow University），简称“苏大”，坐落于历史文化名城苏州。
# 《盗墓笔记》是2014年欢瑞世纪影视传媒股份有限公司出品的一部网络季播剧，改编自南派三叔所著的同名小说，由郑保瑞和罗永昌联合导演，李易峰、杨洋、唐嫣、刘天佐、张智尧、魏巍等主演。
# text = '汉服和服装、知识图谱机器人'

# words = jiagu.cut(text) # 深度学习分词
# print(words)
输入内容 = """


威尔士柯基犬（welsh corgi pembroke）是一种小型犬，它们的胆子很大，也相当机警，能高度警惕地守护家园，是最受欢迎的小型护卫犬之一。 [1] 

    TA说

腿短，我是认真的——柯基的故事 2018-09-05 15:09
有这样一种宠物狗，当看第一眼的时候，一定有三个字从你脑海跳出——“小短腿”。时下它已变得非常出名，甚至可以说已经成为一种网红品种。它就鼎鼎大名的“电动肥臀”——柯基犬。...详情
内容来自

中文学名
    威尔士柯基犬 
别    称
    卡迪根威尔士柯基犬、彭布罗克威尔士柯基犬 
界
    动物界 
门
    脊索动物门 Chordata 
亚    门
    脊椎动物亚门 
纲
    哺乳纲Mammalia 
亚    纲
    真兽亚纲 
目
    食肉目 
亚    目
    裂脚亚目 
科
    犬科 

亚    科
    犬亚科 
属
    犬属 
亚    属
    狗亚属 
种
    威尔士柯基犬 
亚    种
    家犬 
英文名
    welsh corgi pembroke 
犬 种
    牧牛犬 
寿 命
    12-15年 
身    高
    25cm－30cm 
体    重
    10kg－12kg 
市场参考价
    1000-10000元 

目录

    1 发展历史
    2 形态特征
    3 性格特征

    4 饲养方法
    5 梳理犬毛
    6 自身保护

    7 繁殖与配种

发展历史
编辑
威尔士柯基犬为1107年由法兰德斯工人携带过来的犬种，根据其近似狐狸的头部，有人认为本犬与尖嘴犬祖先关系密切。但也有人认为是随着威尔士与瑞典贸易传至威尔士的瑞典短脚长身犬和土著犬交配，产生了柯基犬。威尔士柯基犬名字来自威而斯语“corrci”娇小之犬的意思。本犬有潘布鲁克犬与卡迪肯犬两种变种犬。潘布鲁克犬比卡迪肯犬名气大，本犬虽然体型娇小，却一直深受高阶层人士喜爱。从12世纪的查理一世到现在的女王伊丽莎白二世，威尔士柯基犬一直是英国王室的宠物 [2]  。
形态特征
编辑
耳中等大小，直立，耳尖呈圆形，棕褐色眼睛中等大小，呈卵圆形。眼睛中等大小，不突出，眼圈为暗黑色，眼角清晰。嘴鼻部优美且紧凑，缺毛，为先天性特征。胸部宽度适中，向下逐渐变细，在前肢之间放松。后驱的肌肉发达且结实，但宽度略小于肩部。体躯比卡狄犬略小 [3]  。
被毛长度适中，绒毛层短而厚，外层被毛较长而粗糙，能抵御各种环境条件。全身毛长度不等，颈圈、胸部和肩部稍厚而长，躯干被毛平伏。前肢腹面、下腹部与后躯腹面毛比较长。被毛最好是直的。该犬容易褪毛。毛色有淡黄色短毛，金色短毛，红色短毛，黄褐色和白色短毛 [4]  。

"""
# knowledge = jiagu.knowledge(text)
# print(knowledge)
# 
# def 获取知识(输入内容):
#     知识 = jiagu.knowledge(输入内容)
#     print(知识)
#     return 知识
# 
# 获取知识(输入内容)
# import Terry_toolkit as tkit
# def 获取知识v2(输入内容):
#     ie=tkit.TripleIE(model_path="/mnt/data/dev/model/ltp/ltp_data_v3.4.0")
#     for it in ie.get(输入内容):
#         if it== None:
#             pass
#         else:
#             print(it)
# 
# 获取知识v2(输入内容)

text = '''
该研究主持者之一、波士顿大学地球与环境科学系博士陈池（音）表示，“尽管中国和印度国土面积仅占全球陆地的9%，但两国为这一绿化过程贡献超过三分之一。考虑到人口过多的国家一般存在对土地过度利用的问题，这个发现令人吃惊。”
NASA埃姆斯研究中心的科学家拉玛·内曼尼（Rama Nemani）说，“这一长期数据能让我们深入分析地表绿化背后的影响因素。我们一开始以为，植被增加是由于更多二氧化碳排放，导致气候更加温暖、潮湿，适宜生长。”
“MODIS的数据让我们能在非常小的尺度上理解这一现象，我们发现人类活动也作出了贡献。”
NASA文章介绍，在中国为全球绿化进程做出的贡献中，有42%来源于植树造林工程，对于减少土壤侵蚀、空气污染与气候变化发挥了作用。
据观察者网过往报道，2017年我国全国共完成造林736.2万公顷、森林抚育830.2万公顷。其中，天然林资源保护工程完成造林26万公顷，退耕还林工程完成造林91.2万公顷。京津风沙源治理工程完成造林18.5万公顷。三北及长江流域等重点防护林体系工程完成造林99.1万公顷。完成国家储备林建设任务68万公顷。
'''
keywords = jiagu.summarize(text, 5) # 关键词
print(keywords)