from libs import *

text="""
琥珀千里光琥珀千里光（学名：）是菊科千里光属的植物。
分布在俄罗斯、蒙古、朝鲜以及中国大陆的河南、陕西、河北、吉林、黑龙江、辽宁、甘肃、山东等地，生长于海拔150米至1,500米的地区，一般生于草坡，目前尚未由人工引种栽培。

彼得·威廉·科萨尔彼得·威廉·科萨尔（Pieter Willem Korthals，）为荷兰植物学家。
1831年至1836年，他在荷属东印度群岛任官方植物学家。
他的很多发现都是关于药用植物美丽帽柱木（"Mitragyna speciosa"）的。
1839年，他发表了世界上第一部关于猪笼草的专著——《关于猪笼草属》（Over het geslacht "Nepenthes"）。

黄海葵黄海葵（学名：）为海葵科侧花海葵属的动物。
分布于日本、美国以及沿海等，一般固着在埋在沙中的小石和岩礁上。

干旱干旱指某一地区长期无雨或高温少雨，使空气及土壤的水分缺乏。
而干旱发生主要与偶发性或周期性的降水减少有关。
从人的因素上来考虑，人为活动导致干旱发生的原因主要有以下四个方面：一是人口增加，导致有限的水资源逐渐短缺。
二是森林植物被人类破坏，植物的蓄水作用丧失，便抽取地下水，导致地下水和土壤水减少。
三是人类活动造成大量水污染，使可用水资源减少。
四是用水浪费。
干旱是对人类社会影响最为严重的气候灾害之一，它具有出现频率高、持续时间长、波及范围广的特点。
干旱的频繁发生和长期持续，不但会给社会经济，特别是农业生产带来巨大的损失，还会造成水资源短缺、荒漠化加剧、沙尘暴频发等诸多生态和环境方面的不利影响。
 仅从自然的角度来看，干旱和旱灾是两个不同的科学概念。
干旱通常指淡水总量少，无法满足人的基本生存和经济发展的气候现象。
干旱一般是长周期现象；而旱灾属于偶发性的自然灾害，通常水资源丰富的地区也会因突发的气候异常而导致旱灾。

旱灾指因气候严重或不正常地干旱而形成的气象灾害。
一般指因土壤水分不足，农作物水分平衡遭到破坏而减产或欠收，从而带来粮食问题，甚至引发饥荒。
同时，旱灾亦可令人类及动物因缺乏足够的饮用水而致死。

中国历代容易发生旱灾，帝王在旱灾发生时常有祈雨的活动，例如《册府元龟》卷一四五《帝王部弭灾》：“长兴二年四月乙巳，帝幸龙门寺祈雨，至晩，还宫”。
崇祯末年，旱灾频繁，崇祯本人虽然精励图治，最后仍导致亡国。
《益都县志》记载1639年：“自正月不雨至于六月，七月大蝗，岁大饥，人相食，流民载道”；光绪年间亦有大旱，1876年12月11日的《申报》记载，由于旱灾，山东各地灾民纷纷逃荒，各处“饥黎鬻妻卖子流离死亡者多，其苦不堪言状”，丁丑年（1877年），山西旱荒严重，到处都有人食人现象，山西巡抚曾国荃在奏议中说灾区“赤地千有余里，饥民至五六百万之众，大奇灾，古所未见”，饥民铤而走险，“拦路纠抢，私立大纛，上书‘王法难犯，饥饿难当’八字”。

此外，旱灾后则容易发生蝗灾，进而引发更严重的饥荒，人民更是饱受迁徙流离之苦，引致社会动荡。
明代丘濬指出：“劫禾之举，此盗贼祸乱之萌。
”。
因此，为了维持公共秩序，救荒几乎是执政者的重要课题，《周礼·地官·大司徒》总结了“荒政十二条”，《管子·度地》云：“善为国者，必先除其五害。

1.
气象干旱:根据不足降水量,以特定历时降水的绝对值表示。

2.
气候干旱:根据不足降水量,不是以特定数量,是以与平均值或正常值的比率表示。

3.
大气干旱:不仅涉及降水量,而且涉及温度、湿度、风速、气压等气候因素。

4.
农业干旱:主要涉及土壤含水量和植物生态,或许是某种特定作物的性态。

5.
水文干旱:主要考虑河道流量的减少,湖泊或水库库容的减少和地下水位的下降。

6.
用水管理干旱:其特性是由于用水管理的实际操作或设施的破坏引起的缺水。

1.
气象干旱:不正常的干燥天气时期,持续缺水足以影响区域引起严重水文不平衡。

2.
农业干旱:降水量不足的气候变化,对作物产量或牧场产量足以产生不利影响。

3.
水文干旱:在河流、水库、地下水含水层、湖泊和土壤中低于平均含水量的时期。

干旱的分类小旱连续无降雨天数，春季达16～30天、夏季16～25天、秋冬季31～50天。
特点：特点为降水较常年偏少，地表空气干燥，土壤出现水分轻度不足，对农作物有轻微影响；中旱连续无降雨天数，夏季26～35天、秋冬季51～70天。

干旱预警信号干旱预警信号分二级，分别以橙色、红色表示。
干旱指标等级划分，以国家标准《气象干旱等级》中的综合气象干旱指数为标准。

干燥指数是反映某个地区的气候干燥程度的指标，通常定义为年蒸发能力和年降水量的比值，即：r=E0/P 式中 r——干燥指数； E0——年蒸发能力，常以E-601水面蒸发量代替，mm；P——年降水量，mm。
 根据选用站E-601蒸发器多年平均年水面蒸发量和多年平均年降水量，可算得多年平均年干燥指数。
多年平均年干燥指数r与气候分布有密切关系，当r<1.
0时，表示该区域蒸发能力小于降水量，该地区为湿润气候，当r>1.
0时，即蒸发能力超过降水量，说明该地区偏于干燥，r越大，即蒸发能力超过降水量越多，干燥程度就越严重。

中国地处东亚季风区，降水变数大，干旱和洪涝灾害频繁，旱灾往往在较大范围发生且可持续多年，故对农业生产危害甚重。

其中出现于宋、元、明、清等不同的朝代和不同的冷暖气候背景下的有代表性的事例分别是：公元989年为中原地区干旱之典型，该年开封的年降水量推算为191毫米，为最近的50年所未见；公元990年的年降水量为357毫米。
旱区中心地带这2年的年降水量平均减少近6成，连续2年平均降水量不足300毫米，这也低于最近50年的最低气象记录。
1585年～1590年（明万历十四至十八年）的干旱地域广泛、变化较大；大范围干旱持续6年，并出现在小冰期最寒冷阶段发生之前的相对温和时段。
此次干旱可分为前后两段，前段呈北旱南涝的旱涝分布格局，后段旱涝分布格局有改变，北方开始多雨，干旱区扩大并南移至长江流域及江南。
前段受旱最重的是河北、山西，后段受旱最重的是江苏、安徽和湖南，旱灾持续最久的则是河南。
1589年干旱达到最强，1585～1590年间各地河湖井泉干涸记录可以旁证当时的干旱程度，其中1589年的许多干涸记录为最近50年所未见。
例如，安徽“淮河竭、井泉涸、野无青草”；浙江“运河龟坼赤地千里，河中无勺水”等。
这次干旱事件尚伴有大范围饥荒和瘟疫，疫区随大旱地区而转移。

1637年～1643年（明崇桢十至十六年）南北方连续7年大范围干旱，又称崇祯大旱，出现在小冰期寒冷气候背景下，为近百年所未见；中国南、北方23个省（区）相继遭受严重旱灾。
干旱少雨的主要区域在华北，河北、河南、山西、陕西、山东，这些地区都连旱5年以上，旱区中心所在的河南省，连旱7年之久，以1640年干旱最为猖獗。
干旱事件前期呈北旱南涝的格局，且旱区逐年向东、南扩大；1640年以后北方降雨增多，转变为北涝南旱。
在这期间瘟疫流行、蝗虫灾害猖獗。

1784年～1787年的大范围持续干旱事件则出现在小冰期中的相对温暖阶段；1785年为江淮和长江中下游干旱之典型，据史料记载：“太湖水涸百余里，湖底掘得独木舟”。
黄河中下游和江淮地区严重旱灾持续4年，并伴随严重的蝗灾和瘟疫，其持续少雨时间和酷旱记述为近50年所未见。
江淮及太湖地区1785年夏季降水量低于现代记录的极小值。
如苏州1785年夏季6～8月雨日数仅28天，夏季降水量的推算值为174毫米，为18世纪夏季（6～8月）雨量的次低值，也低于1951～2000年的最低降水量记录，其距平百分率低达－57.
4%，即夏季雨量的减少近6成。
在持续旱灾期间，黄河下游及黄淮、江淮飞蝗大爆发，还出现疫病大流行。

1876年～1878年（清光绪二至四年）持续3年大范围干旱，发生在全球大范围气候转暖的背景下。
1877年为中国北方大旱的典型例子，在旱区中心的山西省南部二百余日无透雨，陕西华阴县1877年无降雨日数达290天以上，汉水、汾水、浍水、汶河、渠河水涸。
疫疾伴随旱灾和饥荒迅速发生并蔓延，这期间蝗灾大面积发生。

距萼过路黄距萼过路黄（学名：）是报春花科珍珠菜属的植物，是中国的特有植物。
分布于中国大陆的陕西、湖北、四川等地，生长于海拔1,000米至1,600米的地区，多生长在溪沟旁，目前尚未由人工引种栽培。

对节刺属对节刺属（学名："Horaninovia"）是藜科下的一个属，为一年生草本植物。
该属共有约4种，分布于中亚。

医院医院是治疗和护理病人的机构，也兼做健康检查、疾病预防等。
在越南语的汉越词，日语，韩语及台湾话等也称为病院""。
是由专业分工的医院职员通过医学检查、检验、治疗等设备提供医疗及患病休养服务的一种医疗机构，其服务对象为觉察或认可自己心理上或生理上有严重问题的疾病患者、伤者和接受分娩的孕妇，或者是受到家人和朋友极力劝导到医院寻求帮助的来访者，或者是需要常规健康管理的一般人士。
虽然也有同普通诊所类似的门诊服务，但最大的区别在于医院的留院治疗资源、规模、模式。

大部分医院通常是由政府部门资助，或由宗教团体、社会组织、公司或慈善机构的慈善捐款，不以盈利为目的。
同时，也存在以盈利为目的的私立医院。

旨在处理各种疾病和损伤的医院是综合性医院，它们通常包括急诊部、门诊部、住院部，和较为齐全的检验、检查等辅助诊断科室与部门。
 综合医院通常是一个地区的主要医疗机构，有大量的病床，可以同时为许多病人提供重症监护和长期照顾。

旨在治疗特定疾病或伤害的医院是专科医院。
按不同疾病或伤害，可分为儿科医院、妇产科医院、精神病院、肿瘤医院、传染病医院等。

为病人提供治疗，同时结合的医学生和护理学生的教学工作的医院，是教学医院。
教学医院可以是综合医院，也可以是专科医院。
教学医院通常是医科大学、医学院或综合性大学医学院的附属医院。

只能提供针对常见疾病门诊服务的医疗机构是普通科诊所，另有专门针对特定疾病的专科诊所。
诊所的规模一般都比较小。
诊所也包括公立诊所（社区卫生服务中心）和民营诊所两种。

负责治疗本身疾病并不紧急，不需要住院进行治疗的患者的部门叫门诊部。
门诊部会依照各种疾病分科室，例如内科、外科、眼科、皮肤科、复健科、妇科、中医、儿科等。

负责治疗需要住院治疗的患者的部门叫住院部。
住院部也会依照各种疾病分科室。

如果病人情况需要治疗，一部份可能要做手术。
负责这些疗程的是外科，还有麻醉科配合做手术。

支援部门包括药房、放射科ｘ光、电脑扫描、磁力共振等、记录处、病历档案部。
还有一些非医疗的包括厨房、清洁部门、行政部门、会计等。

医院在古代、近代中国或称医局、医馆，医院对应英语 Hospital 的词源学认为医院是接待、接收、留滞病人的地方。
相对于此，出诊制度则是指医生到病人的家中，上门看病。
史书记载最早的医院出现在古埃及的寺庙，奉祀古希腊医神阿斯克勒庇俄斯的寺庙为一种资料集中地。
古中国僧人法显在公元400年前往斯里兰卡的旅行记录了印度的商人头目在城市里建立了提供医治和医药的房子。

法源：医疗法 (中华民国)中国大陆发布的中国大陆医院排名自2010年起已连续发布了4个年度，逐渐成为全国医院学科的标杆和患者的就医指导。
具有医院机能的船舰，称为医疗船。
一些医疗中心为治疗需要也提供日间留院服务。
医院的工作者称为医护人员，或医疗专业人员，按工种可分为临床、医技、后勤等。
按类别则可分为医生、护士、技师等。
按职称则可分为主任医师（护师、技师）、副主任医师（护师、技师）、主治医师（护师、技师）、医师（护师、技师）、助理医师（护师、技师）。
按服务需要他们可分为临床心理师、职业治疗师、物理治疗师、医检师、医事放射师、呼吸治疗师、营养师、药剂师和助产士等。

1-三十烷醇1-三十烷醇（1-Triacontanol）是一种饱和一元醇，化学式CHO，常见于植物叶表皮蜡，与蜂蜡。
1-三十烷醇是多种植物的生长因子，比较经典的例子是玫瑰，其能显著增长玫瑰的基部分叉数。

黑柔骨鱼黑柔骨鱼（学名：），又名黑软颌鱼，为辐鳍鱼纲巨口鱼目巨口鱼科的其中一种。
分布于全球三大洋海域，为深海鱼类，栖息深度500-3886公尺，体长可达25.
"""
# ns=NextSent()
# ns.load()    
# # print(ns.auto_pre(text_a,text))
# for li in ns.auto_pre(text_a,text):
#     print(li)
text_a='是指持续时间在3年以上，干旱区域覆盖4个省份以上的干旱事件。'
import tkitText
from transformers import BertTokenizer, BertForNextSentencePrediction
import torch
import tkitNextSents

ns=tkitNextSents.NextSents("/mnt/data/dev/github/gpt2Write/gpt2Write/tkitfiles/bertNext/")
ns.load_model()
# pone=ns.pre_one(text_a,text_b)
# print("预测单条结果",pone)
for i in range(0,500):
    print(i)
# #从文本中计算符合下一句的句子
# p=ns.pre_from_text(text_a,text)
# print('',p)

# tokenizer = BertTokenizer.from_pretrained('tkitfiles/bertNext/')
# model = BertForNextSentencePrediction.from_pretrained('tkitfiles/bertNext/')

# tt=tkitText.Text()
# sents=tt.sentence_segmentation_v1(text)

# for sent in sents:
#     print("##"*20)
#     text_a=sent
#     c=[]
#     for sent in sents:
#         ptext=text_a+"[SEP]"+sent
#         input_ids = torch.tensor(tokenizer.encode(ptext, add_special_tokens=True)).unsqueeze(0)  # Batch size 1
#         # print(input_ids)
#         outputs = model(input_ids)
#         # print(outputs)
#         seq_relationship_scores = outputs[0]
#         # print(seq_relationship_scores)
#         print(seq_relationship_scores.softmax(dim = 1).tolist()[0][1])
#         # print(sent)
        
#         # print(torch.argmax(seq_relationship_scores).tolist())
#         p=torch.argmax(seq_relationship_scores).tolist()
#         # print(p)
#         if p==1:
#             c.append(sent)

#     print(text_a)
#     print(c)
